---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Room.UpperLimit
zh: 房间
source: html/ee4b5be1-482f-e195-e522-28cc2d90dd9a.htm
---
# Autodesk.Revit.DB.Architecture.Room.UpperLimit Property

**中文**: 房间

Get or Set the Upper Limit of the Room.

## Syntax (C#)
```csharp
public Level UpperLimit { get; set; }
```

## Remarks
This property is used to get or set the Upper Limit of the Room.